Public Attributes | List of all members
API_PrimHotspot Struct Reference
Geometry | Library Part Management
A primitive hotspot. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Prim_Head  | head
General primitive element header (not used with ACAPI_LibraryPart_GetHotspots).
API_Coord  | loc
Coordinate of the hotspot.
API_Neig  | neig
Neig index and unique ID of the hotspot.
Detailed Description
A primitive hotspot.
Member Data Documentation
◆ head
 API_PrimHotspot::head
General primitive element header (not used with ACAPI_LibraryPart_GetHotspots).
◆ loc
 API_PrimHotspot::loc
Coordinate of the hotspot.
◆ neig
 API_PrimHotspot::neig
Neig index and unique ID of the hotspot.